CSI API ETABS v1

# cCaseHyperStaticSetBaseCase Method

---

Sets the base case for the specified hyperstatic load case

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetBaseCase(
    	string Name,
    	string HyperStaticCase
    )

    Function SetBaseCase (
    	Name As String,
    	HyperStaticCase As String
    ) As Integer

    Dim instance As cCaseHyperStatic
    Dim Name As String
    Dim HyperStaticCase As String
    Dim returnValue As Integer

    returnValue = instance.SetBaseCase(Name,
    	HyperStaticCase)

    int SetBaseCase(
    	String^ Name,
    	String^ HyperStaticCase
    )

    abstract SetBaseCase :
            Name : string *
            HyperStaticCase : string -> int

#### Parameters

Name

    Type: SystemString
The name of an existing hyperstatic load case

HyperStaticCase

    Type: SystemString
The name of an existing static linear load case that is the base case for the
specified hyperstatic load case

#### Return Value

Type: Int32
Returns zero if the base case is successfully set; otherwise it returns a
nonzero value

Remarks

See Also

#### Reference

cCaseHyperStatic Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com